Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.Transmittance
The visual light transmittance value (VLT-value) for the window type, from 0.0 to 1.0.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.SolarHeatGainCoefficient
The solar heat gain coefficient (SHGC-value) for the window type, from 0.0 to 1.0.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.HeatTransferCoefficient
The heat transfer coefficient value (U-value) of the window type, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.IsSchematic
Indicates if this originates from a schematic or analytical construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
The EnergyAnalysisWindowType class contains the thermal properties (e.g., heat transfer coefficient) of the window-type analytical openings.
Since:
2024